app/controllers/messages_controller.rb

  def index
    sleep 2
    @messages = Message.all
---
SELECT "messages".* FROM "messages"

  def create
    sleep 2
    message = Message.new(message_params)
    message.save!
---
INSERT INTO "messages" ("author", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["author", "fdsa"], ["text", "fwefa"], ["created_at", "2021-06-08 23:36:48.150161"], ["updated_at", "2021-06-08 23:36:48.150161"]]